function output=insert_cp(input,cp_length)%输入的是OFDM和导频符号的时域序列，cp_length为循环前缀长度
         [m,n]=size(input);%-----------------------------------------------输入时序序列的SIZE为：长m=256行，宽n=120列
         output=zeros(m+cp_length,n);%-------------------------------------输出的序列为：长m+cp长度=272行，宽仍然为n=120列
                                     %-------------------------------------以下循环为各列插入循环前缀
         output(1:cp_length,:)=input((m-cp_length+1):m,:);%----------------循环前缀里面的16行*120列的数据就是由输入的OFDM和导频符号时序矩阵的最后16行*120列得到的
         output((cp_length+1):(m+cp_length),:)=input;%---------------------output剩余的部分就是输入的时域序列矩阵
         
             
