function output=lr_lmmse_estimation(input,pilot_inter,pilot_sequence,trms,t_max,snr,NCP)
%输入256行*120列的信号矩阵，导频间隔5，导频符号Xp是256行*1列，snr是信噪比的真值，NCP是循环前缀CP的长度16
%trms为多经信道的平均延时，此处所有的时间都是已经对采样间隔做了归一化后的结果，值为0.4937
%t_max为最大延时,此处所有的时间都是已经对采样间隔做了归一化后的结果，值为1.5744

beta=17/9;%----------------------------------------------------------------16QAM时系数是17/9，64QAM？？？？？？？？？？
j=sqrt(-1);%---------------------------------------------------------------复数j
[N,NL]=size(input);%-------------------------------------------------------输入信号矩阵的大小，N=256（行），NL=120（列）
Rhh=zeros(N,N);%-----------------------------------------------------------自相关矩阵为一个256行*256列的方阵

%%%%%%%%%%%%理想负指数分布时的自相关信道矩阵求解？？？？？？？？%%%%%%%%%%%%%%%
for k=1:N
    for l=1:N
        Rhh(k,l)=(1-exp((-1)*t_max*((1/trms)+j*2*pi*(k-l)/N)))./(trms*(1-exp((-1)*t_max/trms))*((1/trms)+j*2*pi*(k-l)/N));
    end
end

%%%以下过程是对Rhh矩阵进行特征值分解，并按特征值大小排队，选最大的16个特征值%%%%

[U,D]=eig(Rhh);%-----------------------------------------------------------U为满秩酉阵（特征向量组成的矩阵），D是以特征值为主对角线的对角阵
dlamda=diag(D);%-----------------------------------------------------------取D对角元素构成一个列向量
[dlamda_sort,IN]=sort(dlamda);%--------------------------------------------按升序排列各特征值，dlamda_sort为排序结果，IN为各元素在原向量中的位置索引

for k=1:N
    lamda_sort(k)=dlamda_sort(N-k+1);%-------------------------------------按照降序排列各特征值
    IN_new(k)=IN(N-k+1);%--------------------------------------------------得到对应的特征值在原来向量中的位置索引
end

%%%%%%%%%%%%%%%%%%%%%%%%以下按照IN_new顺序排列U的各列%%%%%%%%%%%%%%%%%%%%%%%%
U_new=zeros(N,N);
for k=1:N
    U_new(:,k)=U(:,IN_new(k));%--------------------------------------------新的U矩阵：每一个特征值对应一个特征向量
end

%%%%%%%%%%%%%%%%%%%以下只取前cp个特征值构成新的对角阵%%%%%%%%%%%%%%%%%%%%%%%%%
delta=zeros(N,1);
for k=1:N
    if k<=NCP
       delta(k)=lamda_sort(k)/(lamda_sort(k)+beta/snr);
    else
        delta(k)=0;
    end
end

D_new=diag(delta);%-------------------------------------------------------

i=1;
count=1;
while i<=NL
    Hi=input(:,i)./pilot_sequence;%----------------------------------------计算LS信道估计值
    output(:,count)=U_new*D_new*(U_new')*Hi;%------------------------------SVD方法在导频位置处的信道估计值，输出
    count=count+1;
    i=i+pilot_inter+1;
end
  
