function output=ls_estimation(input,pilot_inter,pilot_sequence)  %输入256行*120列的信号矩阵，导频间隔5，导频符号Xp是256行*1列
[N,NL]=size(input);%-------------------------------------------------------得到待估计信号矩阵的大小，N=256（行），NL=120（列）
i=1;
count=1;
  while i<=NL%-------------------------------------------------------------将120个OFDM符号+20个导频符号全部过一遍
      output(:,count)=input(:,i)./pilot_sequence;%-------------------------不断找到导频的位置，然后将对应导频处的响应Yp与已知的Xp对应元素相除，最后输出
      count=count+1;%------------------------------------------------------count是导频符号的计数器，记满20个
      i=i+pilot_inter+1;
  end