function output=mmse_estimation(input,pilot_inter,pilot_sequence,trms,t_max,var)

%输入256行*120列的信号矩阵，导频间隔5，导频符号Xp是256行*1列，snr是信噪比的真值
%trms为多经信道的平均延时，此处所有的时间都是已经对采样间隔做了归一化后的结果，值为0.4937
%t_max为最大延时,此处所有的时间都是已经对采样间隔做了归一化后的结果，值为1.5744

j=sqrt(-1);%---------------------------------------------------------------复数j
[N,NL]=size(input);%-------------------------------------------------------输入信号矩阵的大小，N=256（行），NL=120（列）
Rhh=zeros(N,N);%---------------------------------------------------------自相关矩阵为一个120行*120列的方阵

%%%%%%%%%%%%%%%%%%%%%%%%%%%计算LS信道估计%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
i=1;
count=1;
while i<=NL
    Hls(:,count)=input(:,i)./pilot_sequence;%------------------------------算出LS信道估计
    count=count+1;
    i=i+pilot_inter+1;
end

%%%%%%%%%%%%理想负指数分布时的自相关信道矩阵求解%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%

for k=1:N
    for l=1:N%------------------------------------------------------------算出自相关函数Rhh
        Rhh(k,l)=(1-exp((-1)*t_max*((1/trms)+j*2*pi*(k-l)/N)))./(trms*(1-exp((-1)*t_max/trms))*((1/trms)+j*2*pi*(k-l)/N));
    end
end

weiner_coeff=Rhh*inv(Rhh+(var)*eye(N));
output=weiner_coeff*Hls;
%%%%%%%%%%%%%%根据公式Hmmse=Rhh*Hls*inv(Rhh+var*inv(Xp'Xp))%%%%%%%%%%%%%%%%%%%%%%

